/**
 * 密码（密码至少包含大小写字母、数字、特殊字符、8~16位！）
 */
const validPsw =
  /^(?=.*[0-9])(?=.*[A-Z])(?=.*[a-z])(?=.*[!_#%&@*.?+$^[\](){}|/\\])[0-9A-Za-z!_#%&@*.?+$^[\](){}|/\\].{7,15}$/

/**
 * 手机号
 */
const validPhone = /^1[3-9]\d{9}$/

/**
 * 邮箱
 */
const validEmail =
  /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/

/**
 * 邮箱
 */
const validUrl =
  /^((http|https):\/\/)?[a-z0-9]+([\-\.]{1}[a-z0-9]+)*\.[a-z]{2,5}(:[0-9]{1,5})?(\/.*)?$/

export const validate = {
  validPsw,
  validPhone,
  validEmail,
	validUrl
}
